---
kind: method
id: M:Autodesk.Revit.DB.Subelement.GetReference
source: html/62e0779b-25c1-b83a-0a13-ed2bf9cececc.htm
---
# Autodesk.Revit.DB.Subelement.GetReference Method

Obtains the reference to this subelement.

## Syntax (C#)
```csharp
public Reference GetReference()
```

## Returns
The reference to this subelement.